In [123]:
import numpy as np
import pandas as pd

In [124]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [125]:
df = pd.DataFrame(data)

In [126]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [128]:
byCompany = df.groupby('Company')

In [131]:
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [132]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [143]:
byCompany.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [139]:
df.groupby('Company').sum().loc['FB']['Sales']

593

In [152]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [1]:
import pandas as pd

In [2]:
pwd

'/Users/sid/Downloads/Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas'

In [3]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df = pd.read_csv('example')

In [6]:
df.to_csv('My_Output',index=False)

In [7]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [13]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [ ]:
data = pd.read_html('https://www.nseindia.com/companies-listing/corporate-filings-shareholding-pattern')

In [16]:
from sqlalchemy import create_engine

In [18]:
engine = create_engine('sqlite:///:memory:')

In [22]:
df.to_sql('my_table',engine)

ValueError: Table 'my_table' already exists.

In [23]:
sqldf = pd.read_sql('my_table',con=engine)

In [26]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15